SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_conv.h
/**************************************************************************//**
 * @file
 * @brief EFR32FG25 CONV register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32FG25_CONV_H
#define EFR32FG25_CONV_H
#define CONV_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32FG25_CONV CONV
 * @{
 * @brief EFR32FG25 CONV Register Declaration.
 *****************************************************************************/

/** CONV Register Declaration. */
typedef struct {
  __IM uint32_t  IPVERSION;                     /**< IP Version ID                                      */
  __IOM uint32_t EN;                            /**< Module Enable                                      */
  __IOM uint32_t SWRST;                         /**< Software Reset                                     */
  __IOM uint32_t CONNECT;                       /**< FIFO connect control                               */
  __IOM uint32_t DISCLK;                        /**< Disable Clocks                                     */
  uint32_t       RESERVED0[3U];                 /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN;                        /**< New Register                                       */
  uint32_t       RESERVED1[7U];                 /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT;                       /**< New Register                                       */
  uint32_t       RESERVED2[23U];                /**< Reserved for future use                            */
  __IOM uint32_t FMTIN;                         /**< New Register                                       */
  uint32_t       RESERVED3[7U];                 /**< Reserved for future use                            */
  __IOM uint32_t FMTOUT;                        /**< New Register                                       */
  uint32_t       RESERVED4[79U];                /**< Reserved for future use                            */
  __IOM uint32_t CTRL;                          /**< New Register                                       */
  __IOM uint32_t POLY;                          /**< New Register                                       */
  __IOM uint32_t PUNCT;                         /**< New Register                                       */
  __IOM uint32_t FRAMELENGTH;                   /**< New Register                                       */
  __IOM uint32_t PADLENGTH;                     /**< New Register                                       */
  __IOM uint32_t PADDATA;                       /**< New Register                                       */
  __IOM uint32_t INITDATA;                      /**< New Register                                       */
  __IOM uint32_t TAILDATA;                      /**< New Register                                       */
  __IOM uint32_t DBG;                           /**< New Register                                       */
  __IM uint32_t  STAT;                          /**< New Register                                       */
  __IM uint32_t  STATLGTH;                      /**< New Register                                       */
  __IOM uint32_t IF;                            /**< Interrupt Flag                                     */
  __IOM uint32_t IEN;                           /**< Interrupt Enable                                   */
  uint32_t       RESERVED5[883U];               /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_SET;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_SET;                        /**< Module Enable                                      */
  __IOM uint32_t SWRST_SET;                     /**< Software Reset                                     */
  __IOM uint32_t CONNECT_SET;                   /**< FIFO connect control                               */
  __IOM uint32_t DISCLK_SET;                    /**< Disable Clocks                                     */
  uint32_t       RESERVED6[3U];                 /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN_SET;                    /**< New Register                                       */
  uint32_t       RESERVED7[7U];                 /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT_SET;                   /**< New Register                                       */
  uint32_t       RESERVED8[23U];                /**< Reserved for future use                            */
  __IOM uint32_t FMTIN_SET;                     /**< New Register                                       */
  uint32_t       RESERVED9[7U];                 /**< Reserved for future use                            */
  __IOM uint32_t FMTOUT_SET;                    /**< New Register                                       */
  uint32_t       RESERVED10[79U];               /**< Reserved for future use                            */
  __IOM uint32_t CTRL_SET;                      /**< New Register                                       */
  __IOM uint32_t POLY_SET;                      /**< New Register                                       */
  __IOM uint32_t PUNCT_SET;                     /**< New Register                                       */
  __IOM uint32_t FRAMELENGTH_SET;               /**< New Register                                       */
  __IOM uint32_t PADLENGTH_SET;                 /**< New Register                                       */
  __IOM uint32_t PADDATA_SET;                   /**< New Register                                       */
  __IOM uint32_t INITDATA_SET;                  /**< New Register                                       */
  __IOM uint32_t TAILDATA_SET;                  /**< New Register                                       */
  __IOM uint32_t DBG_SET;                       /**< New Register                                       */
  __IM uint32_t  STAT_SET;                      /**< New Register                                       */
  __IM uint32_t  STATLGTH_SET;                  /**< New Register                                       */
  __IOM uint32_t IF_SET;                        /**< Interrupt Flag                                     */
  __IOM uint32_t IEN_SET;                       /**< Interrupt Enable                                   */
  uint32_t       RESERVED11[883U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_CLR;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_CLR;                        /**< Module Enable                                      */
  __IOM uint32_t SWRST_CLR;                     /**< Software Reset                                     */
  __IOM uint32_t CONNECT_CLR;                   /**< FIFO connect control                               */
  __IOM uint32_t DISCLK_CLR;                    /**< Disable Clocks                                     */
  uint32_t       RESERVED12[3U];                /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN_CLR;                    /**< New Register                                       */
  uint32_t       RESERVED13[7U];                /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT_CLR;                   /**< New Register                                       */
  uint32_t       RESERVED14[23U];               /**< Reserved for future use                            */
  __IOM uint32_t FMTIN_CLR;                     /**< New Register                                       */
  uint32_t       RESERVED15[7U];                /**< Reserved for future use                            */
  __IOM uint32_t FMTOUT_CLR;                    /**< New Register                                       */
  uint32_t       RESERVED16[79U];               /**< Reserved for future use                            */
  __IOM uint32_t CTRL_CLR;                      /**< New Register                                       */
  __IOM uint32_t POLY_CLR;                      /**< New Register                                       */
  __IOM uint32_t PUNCT_CLR;                     /**< New Register                                       */
  __IOM uint32_t FRAMELENGTH_CLR;               /**< New Register                                       */
  __IOM uint32_t PADLENGTH_CLR;                 /**< New Register                                       */
  __IOM uint32_t PADDATA_CLR;                   /**< New Register                                       */
  __IOM uint32_t INITDATA_CLR;                  /**< New Register                                       */
  __IOM uint32_t TAILDATA_CLR;                  /**< New Register                                       */
  __IOM uint32_t DBG_CLR;                       /**< New Register                                       */
  __IM uint32_t  STAT_CLR;                      /**< New Register                                       */
  __IM uint32_t  STATLGTH_CLR;                  /**< New Register                                       */
  __IOM uint32_t IF_CLR;                        /**< Interrupt Flag                                     */
  __IOM uint32_t IEN_CLR;                       /**< Interrupt Enable                                   */
  uint32_t       RESERVED17[883U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_TGL;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_TGL;                        /**< Module Enable                                      */
  __IOM uint32_t SWRST_TGL;                     /**< Software Reset                                     */
  __IOM uint32_t CONNECT_TGL;                   /**< FIFO connect control                               */
  __IOM uint32_t DISCLK_TGL;                    /**< Disable Clocks                                     */
  uint32_t       RESERVED18[3U];                /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN_TGL;                    /**< New Register                                       */
  uint32_t       RESERVED19[7U];                /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT_TGL;                   /**< New Register                                       */
  uint32_t       RESERVED20[23U];               /**< Reserved for future use                            */
  __IOM uint32_t FMTIN_TGL;                     /**< New Register                                       */
  uint32_t       RESERVED21[7U];                /**< Reserved for future use                            */
  __IOM uint32_t FMTOUT_TGL;                    /**< New Register                                       */
  uint32_t       RESERVED22[79U];               /**< Reserved for future use                            */
  __IOM uint32_t CTRL_TGL;                      /**< New Register                                       */
  __IOM uint32_t POLY_TGL;                      /**< New Register                                       */
  __IOM uint32_t PUNCT_TGL;                     /**< New Register                                       */
  __IOM uint32_t FRAMELENGTH_TGL;               /**< New Register                                       */
  __IOM uint32_t PADLENGTH_TGL;                 /**< New Register                                       */
  __IOM uint32_t PADDATA_TGL;                   /**< New Register                                       */
  __IOM uint32_t INITDATA_TGL;                  /**< New Register                                       */
  __IOM uint32_t TAILDATA_TGL;                  /**< New Register                                       */
  __IOM uint32_t DBG_TGL;                       /**< New Register                                       */
  __IM uint32_t  STAT_TGL;                      /**< New Register                                       */
  __IM uint32_t  STATLGTH_TGL;                  /**< New Register                                       */
  __IOM uint32_t IF_TGL;                        /**< Interrupt Flag                                     */
  __IOM uint32_t IEN_TGL;                       /**< Interrupt Enable                                   */
} CONV_TypeDef;
/** @} End of group EFR32FG25_CONV */

/**************************************************************************//**
 * @addtogroup EFR32FG25_CONV
 * @{
 * @defgroup EFR32FG25_CONV_BitFields CONV Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for CONV IPVERSION */
#define _CONV_IPVERSION_RESETVALUE               0x00000001UL                             /**< Default value for CONV_IPVERSION            */
#define _CONV_IPVERSION_MASK                     0xFFFFFFFFUL                             /**< Mask for CONV_IPVERSION                     */
#define _CONV_IPVERSION_IPVERSION_SHIFT          0                                        /**< Shift value for CONV_IPVERSION              */
#define _CONV_IPVERSION_IPVERSION_MASK           0xFFFFFFFFUL                             /**< Bit mask for CONV_IPVERSION                 */
#define _CONV_IPVERSION_IPVERSION_DEFAULT        0x00000001UL                             /**< Mode DEFAULT for CONV_IPVERSION             */
#define CONV_IPVERSION_IPVERSION_DEFAULT         (_CONV_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for CONV_IPVERSION     */

/* Bit fields for CONV EN */
#define _CONV_EN_RESETVALUE                      0x00000000UL                           /**< Default value for CONV_EN                   */
#define _CONV_EN_MASK                            0x00000003UL                           /**< Mask for CONV_EN                            */
#define CONV_EN_EN                               (0x1UL << 0)                           /**< Module Enable                               */
#define _CONV_EN_EN_SHIFT                        0                                      /**< Shift value for CONV_EN                     */
#define _CONV_EN_EN_MASK                         0x1UL                                  /**< Bit mask for CONV_EN                        */
#define _CONV_EN_EN_DEFAULT                      0x00000000UL                           /**< Mode DEFAULT for CONV_EN                    */
#define CONV_EN_EN_DEFAULT                       (_CONV_EN_EN_DEFAULT << 0)             /**< Shifted mode DEFAULT for CONV_EN            */
#define CONV_EN_DISABLING                        (0x1UL << 1)                           /**< Disablement Busy Status                     */
#define _CONV_EN_DISABLING_SHIFT                 1                                      /**< Shift value for CONV_DISABLING              */
#define _CONV_EN_DISABLING_MASK                  0x2UL                                  /**< Bit mask for CONV_DISABLING                 */
#define _CONV_EN_DISABLING_DEFAULT               0x00000000UL                           /**< Mode DEFAULT for CONV_EN                    */
#define CONV_EN_DISABLING_DEFAULT                (_CONV_EN_DISABLING_DEFAULT << 1)      /**< Shifted mode DEFAULT for CONV_EN            */

