SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_conv.h
/* Bit fields for CONV SWRST */
#define _CONV_SWRST_RESETVALUE                   0x00000000UL                           /**< Default value for CONV_SWRST                */
#define _CONV_SWRST_MASK                         0x00000003UL                           /**< Mask for CONV_SWRST                         */
#define CONV_SWRST_SWRST                         (0x1UL << 0)                           /**< Software Reset Command                      */
#define _CONV_SWRST_SWRST_SHIFT                  0                                      /**< Shift value for CONV_SWRST                  */
#define _CONV_SWRST_SWRST_MASK                   0x1UL                                  /**< Bit mask for CONV_SWRST                     */
#define _CONV_SWRST_SWRST_DEFAULT                0x00000000UL                           /**< Mode DEFAULT for CONV_SWRST                 */
#define CONV_SWRST_SWRST_DEFAULT                 (_CONV_SWRST_SWRST_DEFAULT << 0)       /**< Shifted mode DEFAULT for CONV_SWRST         */
#define CONV_SWRST_RESETTING                     (0x1UL << 1)                           /**< Software Reset Busy Status                  */
#define _CONV_SWRST_RESETTING_SHIFT              1                                      /**< Shift value for CONV_RESETTING              */
#define _CONV_SWRST_RESETTING_MASK               0x2UL                                  /**< Bit mask for CONV_RESETTING                 */
#define _CONV_SWRST_RESETTING_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for CONV_SWRST                 */
#define CONV_SWRST_RESETTING_DEFAULT             (_CONV_SWRST_RESETTING_DEFAULT << 1)   /**< Shifted mode DEFAULT for CONV_SWRST         */

/* Bit fields for CONV CONNECT */
#define _CONV_CONNECT_RESETVALUE                 0x00000000UL                           /**< Default value for CONV_CONNECT              */
#define _CONV_CONNECT_MASK                       0x00000101UL                           /**< Mask for CONV_CONNECT                       */
#define CONV_CONNECT_IN                          (0x1UL << 0)                           /**< Input FIFO connect                          */
#define _CONV_CONNECT_IN_SHIFT                   0                                      /**< Shift value for CONV_IN                     */
#define _CONV_CONNECT_IN_MASK                    0x1UL                                  /**< Bit mask for CONV_IN                        */
#define _CONV_CONNECT_IN_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CONV_CONNECT               */
#define CONV_CONNECT_IN_DEFAULT                  (_CONV_CONNECT_IN_DEFAULT << 0)        /**< Shifted mode DEFAULT for CONV_CONNECT       */
#define CONV_CONNECT_OUT                         (0x1UL << 8)                           /**< Output FIFO connect                         */
#define _CONV_CONNECT_OUT_SHIFT                  8                                      /**< Shift value for CONV_OUT                    */
#define _CONV_CONNECT_OUT_MASK                   0x100UL                                /**< Bit mask for CONV_OUT                       */
#define _CONV_CONNECT_OUT_DEFAULT                0x00000000UL                           /**< Mode DEFAULT for CONV_CONNECT               */
#define CONV_CONNECT_OUT_DEFAULT                 (_CONV_CONNECT_OUT_DEFAULT << 8)       /**< Shifted mode DEFAULT for CONV_CONNECT       */

/* Bit fields for CONV DISCLK */
#define _CONV_DISCLK_RESETVALUE                  0x00000002UL                           /**< Default value for CONV_DISCLK               */
#define _CONV_DISCLK_MASK                        0x00000003UL                           /**< Mask for CONV_DISCLK                        */
#define _CONV_DISCLK_DISCLK_SHIFT                0                                      /**< Shift value for CONV_DISCLK                 */
#define _CONV_DISCLK_DISCLK_MASK                 0x3UL                                  /**< Bit mask for CONV_DISCLK                    */
#define _CONV_DISCLK_DISCLK_DEFAULT              0x00000002UL                           /**< Mode DEFAULT for CONV_DISCLK                */
#define _CONV_DISCLK_DISCLK_NONE                 0x00000000UL                           /**< Mode NONE for CONV_DISCLK                   */
#define _CONV_DISCLK_DISCLK_ALL                  0x00000001UL                           /**< Mode ALL for CONV_DISCLK                    */
#define _CONV_DISCLK_DISCLK_AUTO                 0x00000002UL                           /**< Mode AUTO for CONV_DISCLK                   */
#define CONV_DISCLK_DISCLK_DEFAULT               (_CONV_DISCLK_DISCLK_DEFAULT << 0)     /**< Shifted mode DEFAULT for CONV_DISCLK        */
#define CONV_DISCLK_DISCLK_NONE                  (_CONV_DISCLK_DISCLK_NONE << 0)        /**< Shifted mode NONE for CONV_DISCLK           */
#define CONV_DISCLK_DISCLK_ALL                   (_CONV_DISCLK_DISCLK_ALL << 0)         /**< Shifted mode ALL for CONV_DISCLK            */
#define CONV_DISCLK_DISCLK_AUTO                  (_CONV_DISCLK_DISCLK_AUTO << 0)        /**< Shifted mode AUTO for CONV_DISCLK           */

/* Bit fields for CONV FIFOIN */
#define _CONV_FIFOIN_RESETVALUE                  0x00000000UL                           /**< Default value for CONV_FIFOIN               */
#define _CONV_FIFOIN_MASK                        0x1FFF3F0FUL                           /**< Mask for CONV_FIFOIN                        */
#define _CONV_FIFOIN_FID_SHIFT                   0                                      /**< Shift value for CONV_FID                    */
#define _CONV_FIFOIN_FID_MASK                    0xFUL                                  /**< Bit mask for CONV_FID                       */
#define _CONV_FIFOIN_FID_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CONV_FIFOIN                */
#define CONV_FIFOIN_FID_DEFAULT                  (_CONV_FIFOIN_FID_DEFAULT << 0)        /**< Shifted mode DEFAULT for CONV_FIFOIN        */
#define _CONV_FIFOIN_CID_SHIFT                   8                                      /**< Shift value for CONV_CID                    */
#define _CONV_FIFOIN_CID_MASK                    0x3F00UL                               /**< Bit mask for CONV_CID                       */
#define _CONV_FIFOIN_CID_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CONV_FIFOIN                */
#define CONV_FIFOIN_CID_DEFAULT                  (_CONV_FIFOIN_CID_DEFAULT << 8)        /**< Shifted mode DEFAULT for CONV_FIFOIN        */
#define _CONV_FIFOIN_REM_SHIFT                   16                                     /**< Shift value for CONV_REM                    */
#define _CONV_FIFOIN_REM_MASK                    0xFF0000UL                             /**< Bit mask for CONV_REM                       */
#define _CONV_FIFOIN_REM_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CONV_FIFOIN                */
#define CONV_FIFOIN_REM_DEFAULT                  (_CONV_FIFOIN_REM_DEFAULT << 16)       /**< Shifted mode DEFAULT for CONV_FIFOIN        */
#define _CONV_FIFOIN_ALARM_SHIFT                 24                                     /**< Shift value for CONV_ALARM                  */
#define _CONV_FIFOIN_ALARM_MASK                  0x1F000000UL                           /**< Bit mask for CONV_ALARM                     */
#define _CONV_FIFOIN_ALARM_DEFAULT               0x00000000UL                           /**< Mode DEFAULT for CONV_FIFOIN                */
#define CONV_FIFOIN_ALARM_DEFAULT                (_CONV_FIFOIN_ALARM_DEFAULT << 24)     /**< Shifted mode DEFAULT for CONV_FIFOIN        */

/* Bit fields for CONV FIFOOUT */
#define _CONV_FIFOOUT_RESETVALUE                 0x00000000UL                           /**< Default value for CONV_FIFOOUT              */
#define _CONV_FIFOOUT_MASK                       0x1FFF0000UL                           /**< Mask for CONV_FIFOOUT                       */
#define _CONV_FIFOOUT_CNT_SHIFT                  16                                     /**< Shift value for CONV_CNT                    */
#define _CONV_FIFOOUT_CNT_MASK                   0xFF0000UL                             /**< Bit mask for CONV_CNT                       */
#define _CONV_FIFOOUT_CNT_DEFAULT                0x00000000UL                           /**< Mode DEFAULT for CONV_FIFOOUT               */
#define CONV_FIFOOUT_CNT_DEFAULT                 (_CONV_FIFOOUT_CNT_DEFAULT << 16)      /**< Shifted mode DEFAULT for CONV_FIFOOUT       */
#define _CONV_FIFOOUT_ALARM_SHIFT                24                                     /**< Shift value for CONV_ALARM                  */
#define _CONV_FIFOOUT_ALARM_MASK                 0x1F000000UL                           /**< Bit mask for CONV_ALARM                     */
#define _CONV_FIFOOUT_ALARM_DEFAULT              0x00000000UL                           /**< Mode DEFAULT for CONV_FIFOOUT               */
#define CONV_FIFOOUT_ALARM_DEFAULT               (_CONV_FIFOOUT_ALARM_DEFAULT << 24)    /**< Shifted mode DEFAULT for CONV_FIFOOUT       */

/* Bit fields for CONV FMTIN */
#define _CONV_FMTIN_RESETVALUE                   0x00000000UL                           /**< Default value for CONV_FMTIN                */
#define _CONV_FMTIN_MASK                         0x0000031FUL                           /**< Mask for CONV_FMTIN                         */
#define _CONV_FMTIN_ELEMSIZE_SHIFT               0                                      /**< Shift value for CONV_ELEMSIZE               */
#define _CONV_FMTIN_ELEMSIZE_MASK                0x1FUL                                 /**< Bit mask for CONV_ELEMSIZE                  */
#define _CONV_FMTIN_ELEMSIZE_DEFAULT             0x00000000UL                           /**< Mode DEFAULT for CONV_FMTIN                 */
#define CONV_FMTIN_ELEMSIZE_DEFAULT              (_CONV_FMTIN_ELEMSIZE_DEFAULT << 0)    /**< Shifted mode DEFAULT for CONV_FMTIN         */
#define _CONV_FMTIN_ELEMNB_SHIFT                 8                                      /**< Shift value for CONV_ELEMNB                 */
#define _CONV_FMTIN_ELEMNB_MASK                  0x300UL                                /**< Bit mask for CONV_ELEMNB                    */
#define _CONV_FMTIN_ELEMNB_DEFAULT               0x00000000UL                           /**< Mode DEFAULT for CONV_FMTIN                 */
#define _CONV_FMTIN_ELEMNB_ONE                   0x00000000UL                           /**< Mode ONE for CONV_FMTIN                     */
#define _CONV_FMTIN_ELEMNB_TWO                   0x00000001UL                           /**< Mode TWO for CONV_FMTIN                     */
#define _CONV_FMTIN_ELEMNB_FOUR                  0x00000002UL                           /**< Mode FOUR for CONV_FMTIN                    */
#define CONV_FMTIN_ELEMNB_DEFAULT                (_CONV_FMTIN_ELEMNB_DEFAULT << 8)      /**< Shifted mode DEFAULT for CONV_FMTIN         */
#define CONV_FMTIN_ELEMNB_ONE                    (_CONV_FMTIN_ELEMNB_ONE << 8)          /**< Shifted mode ONE for CONV_FMTIN             */
#define CONV_FMTIN_ELEMNB_TWO                    (_CONV_FMTIN_ELEMNB_TWO << 8)          /**< Shifted mode TWO for CONV_FMTIN             */
#define CONV_FMTIN_ELEMNB_FOUR                   (_CONV_FMTIN_ELEMNB_FOUR << 8)         /**< Shifted mode FOUR for CONV_FMTIN            */

/* Bit fields for CONV FMTOUT */
#define _CONV_FMTOUT_RESETVALUE                  0x00000000UL                           /**< Default value for CONV_FMTOUT               */
#define _CONV_FMTOUT_MASK                        0x0000031FUL                           /**< Mask for CONV_FMTOUT                        */
#define _CONV_FMTOUT_ELEMSIZE_SHIFT              0                                      /**< Shift value for CONV_ELEMSIZE               */
#define _CONV_FMTOUT_ELEMSIZE_MASK               0x1FUL                                 /**< Bit mask for CONV_ELEMSIZE                  */
#define _CONV_FMTOUT_ELEMSIZE_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for CONV_FMTOUT                */
#define CONV_FMTOUT_ELEMSIZE_DEFAULT             (_CONV_FMTOUT_ELEMSIZE_DEFAULT << 0)   /**< Shifted mode DEFAULT for CONV_FMTOUT        */
#define _CONV_FMTOUT_ELEMNB_SHIFT                8                                      /**< Shift value for CONV_ELEMNB                 */
#define _CONV_FMTOUT_ELEMNB_MASK                 0x300UL                                /**< Bit mask for CONV_ELEMNB                    */
#define _CONV_FMTOUT_ELEMNB_DEFAULT              0x00000000UL                           /**< Mode DEFAULT for CONV_FMTOUT                */
#define _CONV_FMTOUT_ELEMNB_ONE                  0x00000000UL                           /**< Mode ONE for CONV_FMTOUT                    */
#define _CONV_FMTOUT_ELEMNB_TWO                  0x00000001UL                           /**< Mode TWO for CONV_FMTOUT                    */
#define _CONV_FMTOUT_ELEMNB_FOUR                 0x00000002UL                           /**< Mode FOUR for CONV_FMTOUT                   */
#define CONV_FMTOUT_ELEMNB_DEFAULT               (_CONV_FMTOUT_ELEMNB_DEFAULT << 8)     /**< Shifted mode DEFAULT for CONV_FMTOUT        */
#define CONV_FMTOUT_ELEMNB_ONE                   (_CONV_FMTOUT_ELEMNB_ONE << 8)         /**< Shifted mode ONE for CONV_FMTOUT            */
#define CONV_FMTOUT_ELEMNB_TWO                   (_CONV_FMTOUT_ELEMNB_TWO << 8)         /**< Shifted mode TWO for CONV_FMTOUT            */
#define CONV_FMTOUT_ELEMNB_FOUR                  (_CONV_FMTOUT_ELEMNB_FOUR << 8)        /**< Shifted mode FOUR for CONV_FMTOUT           */

