SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_conv.h
/* Bit fields for CONV CTRL */
#define _CONV_CTRL_RESETVALUE                    0x0000021CUL                              /**< Default value for CONV_CTRL                 */
#define _CONV_CTRL_MASK                          0xE03DDEFFUL                              /**< Mask for CONV_CTRL                          */
#define CONV_CTRL_INPUTMODE                      (0x1UL << 0)                              /**< New BitField                                */
#define _CONV_CTRL_INPUTMODE_SHIFT               0                                         /**< Shift value for CONV_INPUTMODE              */
#define _CONV_CTRL_INPUTMODE_MASK                0x1UL                                     /**< Bit mask for CONV_INPUTMODE                 */
#define _CONV_CTRL_INPUTMODE_DEFAULT             0x00000000UL                              /**< Mode DEFAULT for CONV_CTRL                  */
#define _CONV_CTRL_INPUTMODE_PARTIAL             0x00000000UL                              /**< Mode PARTIAL for CONV_CTRL                  */
#define _CONV_CTRL_INPUTMODE_FULL                0x00000001UL                              /**< Mode FULL for CONV_CTRL                     */
#define CONV_CTRL_INPUTMODE_DEFAULT              (_CONV_CTRL_INPUTMODE_DEFAULT << 0)       /**< Shifted mode DEFAULT for CONV_CTRL          */
#define CONV_CTRL_INPUTMODE_PARTIAL              (_CONV_CTRL_INPUTMODE_PARTIAL << 0)       /**< Shifted mode PARTIAL for CONV_CTRL          */
#define CONV_CTRL_INPUTMODE_FULL                 (_CONV_CTRL_INPUTMODE_FULL << 0)          /**< Shifted mode FULL for CONV_CTRL             */
#define CONV_CTRL_STRUCTURE                      (0x1UL << 1)                              /**< New BitField                                */
#define _CONV_CTRL_STRUCTURE_SHIFT               1                                         /**< Shift value for CONV_STRUCTURE              */
#define _CONV_CTRL_STRUCTURE_MASK                0x2UL                                     /**< Bit mask for CONV_STRUCTURE                 */
#define _CONV_CTRL_STRUCTURE_DEFAULT             0x00000000UL                              /**< Mode DEFAULT for CONV_CTRL                  */
#define _CONV_CTRL_STRUCTURE_non_recursive       0x00000000UL                              /**< Mode non_recursive for CONV_CTRL            */
#define _CONV_CTRL_STRUCTURE_recursive           0x00000001UL                              /**< Mode recursive for CONV_CTRL                */
#define CONV_CTRL_STRUCTURE_DEFAULT              (_CONV_CTRL_STRUCTURE_DEFAULT << 1)       /**< Shifted mode DEFAULT for CONV_CTRL          */
#define CONV_CTRL_STRUCTURE_non_recursive        (_CONV_CTRL_STRUCTURE_non_recursive << 1) /**< Shifted mode non_recursive for CONV_CTRL    */
#define CONV_CTRL_STRUCTURE_recursive            (_CONV_CTRL_STRUCTURE_recursive << 1)     /**< Shifted mode recursive for CONV_CTRL        */
#define _CONV_CTRL_CONSTLENGTH_SHIFT             2                                         /**< Shift value for CONV_CONSTLENGTH            */
#define _CONV_CTRL_CONSTLENGTH_MASK              0x1CUL                                    /**< Bit mask for CONV_CONSTLENGTH               */
#define _CONV_CTRL_CONSTLENGTH_DEFAULT           0x00000007UL                              /**< Mode DEFAULT for CONV_CTRL                  */
#define CONV_CTRL_CONSTLENGTH_DEFAULT            (_CONV_CTRL_CONSTLENGTH_DEFAULT << 2)     /**< Shifted mode DEFAULT for CONV_CTRL          */
#define _CONV_CTRL_PUNCTPERIOD_SHIFT             5                                         /**< Shift value for CONV_PUNCTPERIOD            */
#define _CONV_CTRL_PUNCTPERIOD_MASK              0xE0UL                                    /**< Bit mask for CONV_PUNCTPERIOD               */
#define _CONV_CTRL_PUNCTPERIOD_DEFAULT           0x00000000UL                              /**< Mode DEFAULT for CONV_CTRL                  */
#define _CONV_CTRL_PUNCTPERIOD_ONE               0x00000000UL                              /**< Mode ONE for CONV_CTRL                      */
#define _CONV_CTRL_PUNCTPERIOD_TWO               0x00000001UL                              /**< Mode TWO for CONV_CTRL                      */
#define _CONV_CTRL_PUNCTPERIOD_THREE             0x00000002UL                              /**< Mode THREE for CONV_CTRL                    */
#define _CONV_CTRL_PUNCTPERIOD_FOUR              0x00000003UL                              /**< Mode FOUR for CONV_CTRL                     */
#define _CONV_CTRL_PUNCTPERIOD_FIVE              0x00000004UL                              /**< Mode FIVE for CONV_CTRL                     */
#define _CONV_CTRL_PUNCTPERIOD_SIX               0x00000005UL                              /**< Mode SIX for CONV_CTRL                      */
#define _CONV_CTRL_PUNCTPERIOD_SEVEN             0x00000006UL                              /**< Mode SEVEN for CONV_CTRL                    */
#define _CONV_CTRL_PUNCTPERIOD_EIGHT             0x00000007UL                              /**< Mode EIGHT for CONV_CTRL                    */
#define CONV_CTRL_PUNCTPERIOD_DEFAULT            (_CONV_CTRL_PUNCTPERIOD_DEFAULT << 5)     /**< Shifted mode DEFAULT for CONV_CTRL          */
#define CONV_CTRL_PUNCTPERIOD_ONE                (_CONV_CTRL_PUNCTPERIOD_ONE << 5)         /**< Shifted mode ONE for CONV_CTRL              */
#define CONV_CTRL_PUNCTPERIOD_TWO                (_CONV_CTRL_PUNCTPERIOD_TWO << 5)         /**< Shifted mode TWO for CONV_CTRL              */
#define CONV_CTRL_PUNCTPERIOD_THREE              (_CONV_CTRL_PUNCTPERIOD_THREE << 5)       /**< Shifted mode THREE for CONV_CTRL            */
#define CONV_CTRL_PUNCTPERIOD_FOUR               (_CONV_CTRL_PUNCTPERIOD_FOUR << 5)        /**< Shifted mode FOUR for CONV_CTRL             */
#define CONV_CTRL_PUNCTPERIOD_FIVE               (_CONV_CTRL_PUNCTPERIOD_FIVE << 5)        /**< Shifted mode FIVE for CONV_CTRL             */
#define CONV_CTRL_PUNCTPERIOD_SIX                (_CONV_CTRL_PUNCTPERIOD_SIX << 5)         /**< Shifted mode SIX for CONV_CTRL              */
#define CONV_CTRL_PUNCTPERIOD_SEVEN              (_CONV_CTRL_PUNCTPERIOD_SEVEN << 5)       /**< Shifted mode SEVEN for CONV_CTRL            */
#define CONV_CTRL_PUNCTPERIOD_EIGHT              (_CONV_CTRL_PUNCTPERIOD_EIGHT << 5)       /**< Shifted mode EIGHT for CONV_CTRL            */
#define CONV_CTRL_TAILEN                         (0x1UL << 9)                              /**< New BitField                                */
#define _CONV_CTRL_TAILEN_SHIFT                  9                                         /**< Shift value for CONV_TAILEN                 */
#define _CONV_CTRL_TAILEN_MASK                   0x200UL                                   /**< Bit mask for CONV_TAILEN                    */
#define _CONV_CTRL_TAILEN_DEFAULT                0x00000001UL                              /**< Mode DEFAULT for CONV_CTRL                  */
#define CONV_CTRL_TAILEN_DEFAULT                 (_CONV_CTRL_TAILEN_DEFAULT << 9)          /**< Shifted mode DEFAULT for CONV_CTRL          */
#define _CONV_CTRL_INV_SHIFT                     10                                        /**< Shift value for CONV_INV                    */
#define _CONV_CTRL_INV_MASK                      0x1C00UL                                  /**< Bit mask for CONV_INV                       */
#define _CONV_CTRL_INV_DEFAULT                   0x00000000UL                              /**< Mode DEFAULT for CONV_CTRL                  */
#define CONV_CTRL_INV_DEFAULT                    (_CONV_CTRL_INV_DEFAULT << 10)            /**< Shifted mode DEFAULT for CONV_CTRL          */
#define _CONV_CTRL_NONSYST_SHIFT                 14                                        /**< Shift value for CONV_NONSYST                */
#define _CONV_CTRL_NONSYST_MASK                  0x1C000UL                                 /**< Bit mask for CONV_NONSYST                   */
#define _CONV_CTRL_NONSYST_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for CONV_CTRL                  */
#define CONV_CTRL_NONSYST_DEFAULT                (_CONV_CTRL_NONSYST_DEFAULT << 14)        /**< Shifted mode DEFAULT for CONV_CTRL          */
#define _CONV_CTRL_RECURSEL_SHIFT                18                                        /**< Shift value for CONV_RECURSEL               */
#define _CONV_CTRL_RECURSEL_MASK                 0xC0000UL                                 /**< Bit mask for CONV_RECURSEL                  */
#define _CONV_CTRL_RECURSEL_DEFAULT              0x00000000UL                              /**< Mode DEFAULT for CONV_CTRL                  */
#define CONV_CTRL_RECURSEL_DEFAULT               (_CONV_CTRL_RECURSEL_DEFAULT << 18)       /**< Shifted mode DEFAULT for CONV_CTRL          */
#define CONV_CTRL_ONGOING                        (0x1UL << 20)                             /**< New BitField                                */
#define _CONV_CTRL_ONGOING_SHIFT                 20                                        /**< Shift value for CONV_ONGOING                */
#define _CONV_CTRL_ONGOING_MASK                  0x100000UL                                /**< Bit mask for CONV_ONGOING                   */
#define _CONV_CTRL_ONGOING_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for CONV_CTRL                  */
#define CONV_CTRL_ONGOING_DEFAULT                (_CONV_CTRL_ONGOING_DEFAULT << 20)        /**< Shifted mode DEFAULT for CONV_CTRL          */
#define CONV_CTRL_RST                            (0x1UL << 21)                             /**< New BitField                                */
#define _CONV_CTRL_RST_SHIFT                     21                                        /**< Shift value for CONV_RST                    */
#define _CONV_CTRL_RST_MASK                      0x200000UL                                /**< Bit mask for CONV_RST                       */
#define _CONV_CTRL_RST_DEFAULT                   0x00000000UL                              /**< Mode DEFAULT for CONV_CTRL                  */
#define CONV_CTRL_RST_DEFAULT                    (_CONV_CTRL_RST_DEFAULT << 21)            /**< Shifted mode DEFAULT for CONV_CTRL          */
#define _CONV_CTRL_BYTESWAP_SHIFT                29                                        /**< Shift value for CONV_BYTESWAP               */
#define _CONV_CTRL_BYTESWAP_MASK                 0x60000000UL                              /**< Bit mask for CONV_BYTESWAP                  */
#define _CONV_CTRL_BYTESWAP_DEFAULT              0x00000000UL                              /**< Mode DEFAULT for CONV_CTRL                  */
#define _CONV_CTRL_BYTESWAP_DISABLED             0x00000000UL                              /**< Mode DISABLED for CONV_CTRL                 */
#define _CONV_CTRL_BYTESWAP_HALFWORD             0x00000001UL                              /**< Mode HALFWORD for CONV_CTRL                 */
#define _CONV_CTRL_BYTESWAP_WORD                 0x00000002UL                              /**< Mode WORD for CONV_CTRL                     */
#define CONV_CTRL_BYTESWAP_DEFAULT               (_CONV_CTRL_BYTESWAP_DEFAULT << 29)       /**< Shifted mode DEFAULT for CONV_CTRL          */
#define CONV_CTRL_BYTESWAP_DISABLED              (_CONV_CTRL_BYTESWAP_DISABLED << 29)      /**< Shifted mode DISABLED for CONV_CTRL         */
#define CONV_CTRL_BYTESWAP_HALFWORD              (_CONV_CTRL_BYTESWAP_HALFWORD << 29)      /**< Shifted mode HALFWORD for CONV_CTRL         */
#define CONV_CTRL_BYTESWAP_WORD                  (_CONV_CTRL_BYTESWAP_WORD << 29)          /**< Shifted mode WORD for CONV_CTRL             */
#define CONV_CTRL_BITSWAP                        (0x1UL << 31)                             /**< New BitField                                */
#define _CONV_CTRL_BITSWAP_SHIFT                 31                                        /**< Shift value for CONV_BITSWAP                */
#define _CONV_CTRL_BITSWAP_MASK                  0x80000000UL                              /**< Bit mask for CONV_BITSWAP                   */
#define _CONV_CTRL_BITSWAP_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for CONV_CTRL                  */
#define CONV_CTRL_BITSWAP_DEFAULT                (_CONV_CTRL_BITSWAP_DEFAULT << 31)        /**< Shifted mode DEFAULT for CONV_CTRL          */

