SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_conv.h
/* Bit fields for CONV POLY */
#define _CONV_POLY_RESETVALUE                    0x006D6D6DUL                           /**< Default value for CONV_POLY                 */
#define _CONV_POLY_MASK                          0x007F7F7FUL                           /**< Mask for CONV_POLY                          */
#define _CONV_POLY_POLY0_SHIFT                   0                                      /**< Shift value for CONV_POLY0                  */
#define _CONV_POLY_POLY0_MASK                    0x7FUL                                 /**< Bit mask for CONV_POLY0                     */
#define _CONV_POLY_POLY0_DEFAULT                 0x0000006DUL                           /**< Mode DEFAULT for CONV_POLY                  */
#define CONV_POLY_POLY0_DEFAULT                  (_CONV_POLY_POLY0_DEFAULT << 0)        /**< Shifted mode DEFAULT for CONV_POLY          */
#define _CONV_POLY_POLY1_SHIFT                   8                                      /**< Shift value for CONV_POLY1                  */
#define _CONV_POLY_POLY1_MASK                    0x7F00UL                               /**< Bit mask for CONV_POLY1                     */
#define _CONV_POLY_POLY1_DEFAULT                 0x0000006DUL                           /**< Mode DEFAULT for CONV_POLY                  */
#define CONV_POLY_POLY1_DEFAULT                  (_CONV_POLY_POLY1_DEFAULT << 8)        /**< Shifted mode DEFAULT for CONV_POLY          */
#define _CONV_POLY_POLY2_SHIFT                   16                                     /**< Shift value for CONV_POLY2                  */
#define _CONV_POLY_POLY2_MASK                    0x7F0000UL                             /**< Bit mask for CONV_POLY2                     */
#define _CONV_POLY_POLY2_DEFAULT                 0x0000006DUL                           /**< Mode DEFAULT for CONV_POLY                  */
#define CONV_POLY_POLY2_DEFAULT                  (_CONV_POLY_POLY2_DEFAULT << 16)       /**< Shifted mode DEFAULT for CONV_POLY          */

/* Bit fields for CONV PUNCT */
#define _CONV_PUNCT_RESETVALUE                   0x00010101UL                           /**< Default value for CONV_PUNCT                */
#define _CONV_PUNCT_MASK                         0x00FFFFFFUL                           /**< Mask for CONV_PUNCT                         */
#define _CONV_PUNCT_PUNCT0_SHIFT                 0                                      /**< Shift value for CONV_PUNCT0                 */
#define _CONV_PUNCT_PUNCT0_MASK                  0xFFUL                                 /**< Bit mask for CONV_PUNCT0                    */
#define _CONV_PUNCT_PUNCT0_DEFAULT               0x00000001UL                           /**< Mode DEFAULT for CONV_PUNCT                 */
#define CONV_PUNCT_PUNCT0_DEFAULT                (_CONV_PUNCT_PUNCT0_DEFAULT << 0)      /**< Shifted mode DEFAULT for CONV_PUNCT         */
#define _CONV_PUNCT_PUNCT1_SHIFT                 8                                      /**< Shift value for CONV_PUNCT1                 */
#define _CONV_PUNCT_PUNCT1_MASK                  0xFF00UL                               /**< Bit mask for CONV_PUNCT1                    */
#define _CONV_PUNCT_PUNCT1_DEFAULT               0x00000001UL                           /**< Mode DEFAULT for CONV_PUNCT                 */
#define CONV_PUNCT_PUNCT1_DEFAULT                (_CONV_PUNCT_PUNCT1_DEFAULT << 8)      /**< Shifted mode DEFAULT for CONV_PUNCT         */
#define _CONV_PUNCT_PUNCT2_SHIFT                 16                                     /**< Shift value for CONV_PUNCT2                 */
#define _CONV_PUNCT_PUNCT2_MASK                  0xFF0000UL                             /**< Bit mask for CONV_PUNCT2                    */
#define _CONV_PUNCT_PUNCT2_DEFAULT               0x00000001UL                           /**< Mode DEFAULT for CONV_PUNCT                 */
#define CONV_PUNCT_PUNCT2_DEFAULT                (_CONV_PUNCT_PUNCT2_DEFAULT << 16)     /**< Shifted mode DEFAULT for CONV_PUNCT         */

/* Bit fields for CONV FRAMELENGTH */
#define _CONV_FRAMELENGTH_RESETVALUE             0x00000000UL                                 /**< Default value for CONV_FRAMELENGTH          */
#define _CONV_FRAMELENGTH_MASK                   0x0000FFFFUL                                 /**< Mask for CONV_FRAMELENGTH                   */
#define _CONV_FRAMELENGTH_FRAMELENGTH_SHIFT      0                                            /**< Shift value for CONV_FRAMELENGTH            */
#define _CONV_FRAMELENGTH_FRAMELENGTH_MASK       0xFFFFUL                                     /**< Bit mask for CONV_FRAMELENGTH               */
#define _CONV_FRAMELENGTH_FRAMELENGTH_DEFAULT    0x00000000UL                                 /**< Mode DEFAULT for CONV_FRAMELENGTH           */
#define CONV_FRAMELENGTH_FRAMELENGTH_DEFAULT     (_CONV_FRAMELENGTH_FRAMELENGTH_DEFAULT << 0) /**< Shifted mode DEFAULT for CONV_FRAMELENGTH   */

/* Bit fields for CONV PADLENGTH */
#define _CONV_PADLENGTH_RESETVALUE               0x00000000UL                             /**< Default value for CONV_PADLENGTH            */
#define _CONV_PADLENGTH_MASK                     0x00000FFFUL                             /**< Mask for CONV_PADLENGTH                     */
#define _CONV_PADLENGTH_PADLENGTH_SHIFT          0                                        /**< Shift value for CONV_PADLENGTH              */
#define _CONV_PADLENGTH_PADLENGTH_MASK           0xFFFUL                                  /**< Bit mask for CONV_PADLENGTH                 */
#define _CONV_PADLENGTH_PADLENGTH_DEFAULT        0x00000000UL                             /**< Mode DEFAULT for CONV_PADLENGTH             */
#define CONV_PADLENGTH_PADLENGTH_DEFAULT         (_CONV_PADLENGTH_PADLENGTH_DEFAULT << 0) /**< Shifted mode DEFAULT for CONV_PADLENGTH     */

/* Bit fields for CONV PADDATA */
#define _CONV_PADDATA_RESETVALUE                 0x00000000UL                           /**< Default value for CONV_PADDATA              */
#define _CONV_PADDATA_MASK                       0xFFFFFFFFUL                           /**< Mask for CONV_PADDATA                       */
#define _CONV_PADDATA_PADDATA_SHIFT              0                                      /**< Shift value for CONV_PADDATA                */
#define _CONV_PADDATA_PADDATA_MASK               0xFFFFFFFFUL                           /**< Bit mask for CONV_PADDATA                   */
#define _CONV_PADDATA_PADDATA_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for CONV_PADDATA               */
#define CONV_PADDATA_PADDATA_DEFAULT             (_CONV_PADDATA_PADDATA_DEFAULT << 0)   /**< Shifted mode DEFAULT for CONV_PADDATA       */

