SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_conv.h
/* Bit fields for CONV INITDATA */
#define _CONV_INITDATA_RESETVALUE                0x00000000UL                           /**< Default value for CONV_INITDATA             */
#define _CONV_INITDATA_MASK                      0x0000003FUL                           /**< Mask for CONV_INITDATA                      */
#define _CONV_INITDATA_INITDATA_SHIFT            0                                      /**< Shift value for CONV_INITDATA               */
#define _CONV_INITDATA_INITDATA_MASK             0x3FUL                                 /**< Bit mask for CONV_INITDATA                  */
#define _CONV_INITDATA_INITDATA_DEFAULT          0x00000000UL                           /**< Mode DEFAULT for CONV_INITDATA              */
#define CONV_INITDATA_INITDATA_DEFAULT           (_CONV_INITDATA_INITDATA_DEFAULT << 0) /**< Shifted mode DEFAULT for CONV_INITDATA      */

/* Bit fields for CONV TAILDATA */
#define _CONV_TAILDATA_RESETVALUE                0x00000000UL                           /**< Default value for CONV_TAILDATA             */
#define _CONV_TAILDATA_MASK                      0x0000003FUL                           /**< Mask for CONV_TAILDATA                      */
#define _CONV_TAILDATA_TAILDATA_SHIFT            0                                      /**< Shift value for CONV_TAILDATA               */
#define _CONV_TAILDATA_TAILDATA_MASK             0x3FUL                                 /**< Bit mask for CONV_TAILDATA                  */
#define _CONV_TAILDATA_TAILDATA_DEFAULT          0x00000000UL                           /**< Mode DEFAULT for CONV_TAILDATA              */
#define CONV_TAILDATA_TAILDATA_DEFAULT           (_CONV_TAILDATA_TAILDATA_DEFAULT << 0) /**< Shifted mode DEFAULT for CONV_TAILDATA      */

/* Bit fields for CONV DBG */
#define _CONV_DBG_RESETVALUE                     0x00000402UL                           /**< Default value for CONV_DBG                  */
#define _CONV_DBG_MASK                           0x000007FFUL                           /**< Mask for CONV_DBG                           */
#define _CONV_DBG_LGTH_SHIFT                     0                                      /**< Shift value for CONV_LGTH                   */
#define _CONV_DBG_LGTH_MASK                      0x3UL                                  /**< Bit mask for CONV_LGTH                      */
#define _CONV_DBG_LGTH_DEFAULT                   0x00000002UL                           /**< Mode DEFAULT for CONV_DBG                   */
#define _CONV_DBG_LGTH_PAYLOAD                   0x00000000UL                           /**< Mode PAYLOAD for CONV_DBG                   */
#define _CONV_DBG_LGTH_PAYLOAD_TAIL              0x00000001UL                           /**< Mode PAYLOAD_TAIL for CONV_DBG              */
#define _CONV_DBG_LGTH_PAYLOAD_TAIL_PAD          0x00000002UL                           /**< Mode PAYLOAD_TAIL_PAD for CONV_DBG          */
#define CONV_DBG_LGTH_DEFAULT                    (_CONV_DBG_LGTH_DEFAULT << 0)          /**< Shifted mode DEFAULT for CONV_DBG           */
#define CONV_DBG_LGTH_PAYLOAD                    (_CONV_DBG_LGTH_PAYLOAD << 0)          /**< Shifted mode PAYLOAD for CONV_DBG           */
#define CONV_DBG_LGTH_PAYLOAD_TAIL               (_CONV_DBG_LGTH_PAYLOAD_TAIL << 0)     /**< Shifted mode PAYLOAD_TAIL for CONV_DBG      */
#define CONV_DBG_LGTH_PAYLOAD_TAIL_PAD           (_CONV_DBG_LGTH_PAYLOAD_TAIL_PAD << 0) /**< Shifted mode PAYLOAD_TAIL_PAD for CONV_DBG  */
#define _CONV_DBG_SOFTMODE_SHIFT                 2                                      /**< Shift value for CONV_SOFTMODE               */
#define _CONV_DBG_SOFTMODE_MASK                  0xCUL                                  /**< Bit mask for CONV_SOFTMODE                  */
#define _CONV_DBG_SOFTMODE_DEFAULT               0x00000000UL                           /**< Mode DEFAULT for CONV_DBG                   */
#define _CONV_DBG_SOFTMODE_OFF                   0x00000000UL                           /**< Mode OFF for CONV_DBG                       */
#define _CONV_DBG_SOFTMODE_NO_INV                0x00000001UL                           /**< Mode NO_INV for CONV_DBG                    */
#define _CONV_DBG_SOFTMODE_INV                   0x00000002UL                           /**< Mode INV for CONV_DBG                       */
#define CONV_DBG_SOFTMODE_DEFAULT                (_CONV_DBG_SOFTMODE_DEFAULT << 2)      /**< Shifted mode DEFAULT for CONV_DBG           */
#define CONV_DBG_SOFTMODE_OFF                    (_CONV_DBG_SOFTMODE_OFF << 2)          /**< Shifted mode OFF for CONV_DBG               */
#define CONV_DBG_SOFTMODE_NO_INV                 (_CONV_DBG_SOFTMODE_NO_INV << 2)       /**< Shifted mode NO_INV for CONV_DBG            */
#define CONV_DBG_SOFTMODE_INV                    (_CONV_DBG_SOFTMODE_INV << 2)          /**< Shifted mode INV for CONV_DBG               */
#define _CONV_DBG_SOFTVAL_SHIFT                  4                                      /**< Shift value for CONV_SOFTVAL                */
#define _CONV_DBG_SOFTVAL_MASK                   0x7F0UL                                /**< Bit mask for CONV_SOFTVAL                   */
#define _CONV_DBG_SOFTVAL_DEFAULT                0x00000040UL                           /**< Mode DEFAULT for CONV_DBG                   */
#define CONV_DBG_SOFTVAL_DEFAULT                 (_CONV_DBG_SOFTVAL_DEFAULT << 4)       /**< Shifted mode DEFAULT for CONV_DBG           */

/* Bit fields for CONV STAT */
#define _CONV_STAT_RESETVALUE                    0x00000000UL                           /**< Default value for CONV_STAT                 */
#define _CONV_STAT_MASK                          0x00FF077FUL                           /**< Mask for CONV_STAT                          */
#define _CONV_STAT_STATE_SHIFT                   0                                      /**< Shift value for CONV_STATE                  */
#define _CONV_STAT_STATE_MASK                    0x7FUL                                 /**< Bit mask for CONV_STATE                     */
#define _CONV_STAT_STATE_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CONV_STAT                  */
#define CONV_STAT_STATE_DEFAULT                  (_CONV_STAT_STATE_DEFAULT << 0)        /**< Shifted mode DEFAULT for CONV_STAT          */
#define _CONV_STAT_DOUT_SHIFT                    8                                      /**< Shift value for CONV_DOUT                   */
#define _CONV_STAT_DOUT_MASK                     0x700UL                                /**< Bit mask for CONV_DOUT                      */
#define _CONV_STAT_DOUT_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for CONV_STAT                  */
#define CONV_STAT_DOUT_DEFAULT                   (_CONV_STAT_DOUT_DEFAULT << 8)         /**< Shifted mode DEFAULT for CONV_STAT          */
#define _CONV_STAT_PUNCT_SHIFT                   16                                     /**< Shift value for CONV_PUNCT                  */
#define _CONV_STAT_PUNCT_MASK                    0xFF0000UL                             /**< Bit mask for CONV_PUNCT                     */
#define _CONV_STAT_PUNCT_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for CONV_STAT                  */
#define CONV_STAT_PUNCT_DEFAULT                  (_CONV_STAT_PUNCT_DEFAULT << 16)       /**< Shifted mode DEFAULT for CONV_STAT          */

/* Bit fields for CONV STATLGTH */
#define _CONV_STATLGTH_RESETVALUE                0x00000000UL                           /**< Default value for CONV_STATLGTH             */
#define _CONV_STATLGTH_MASK                      0x0003FFFFUL                           /**< Mask for CONV_STATLGTH                      */
#define _CONV_STATLGTH_STATLGTH_SHIFT            0                                      /**< Shift value for CONV_STATLGTH               */
#define _CONV_STATLGTH_STATLGTH_MASK             0x3FFFFUL                              /**< Bit mask for CONV_STATLGTH                  */
#define _CONV_STATLGTH_STATLGTH_DEFAULT          0x00000000UL                           /**< Mode DEFAULT for CONV_STATLGTH              */
#define CONV_STATLGTH_STATLGTH_DEFAULT           (_CONV_STATLGTH_STATLGTH_DEFAULT << 0) /**< Shifted mode DEFAULT for CONV_STATLGTH      */

