SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_conv.h
/* Bit fields for CONV IF */
#define _CONV_IF_RESETVALUE                      0x00000000UL                           /**< Default value for CONV_IF                   */
#define _CONV_IF_MASK                            0x00000001UL                           /**< Mask for CONV_IF                            */
#define CONV_IF_DONE                             (0x1UL << 0)                           /**< New BitField                                */
#define _CONV_IF_DONE_SHIFT                      0                                      /**< Shift value for CONV_DONE                   */
#define _CONV_IF_DONE_MASK                       0x1UL                                  /**< Bit mask for CONV_DONE                      */
#define _CONV_IF_DONE_DEFAULT                    0x00000000UL                           /**< Mode DEFAULT for CONV_IF                    */
#define CONV_IF_DONE_DEFAULT                     (_CONV_IF_DONE_DEFAULT << 0)           /**< Shifted mode DEFAULT for CONV_IF            */

/* Bit fields for CONV IEN */
#define _CONV_IEN_RESETVALUE                     0x00000000UL                           /**< Default value for CONV_IEN                  */
#define _CONV_IEN_MASK                           0x00000001UL                           /**< Mask for CONV_IEN                           */
#define CONV_IEN_DONE                            (0x1UL << 0)                           /**< New BitField                                */
#define _CONV_IEN_DONE_SHIFT                     0                                      /**< Shift value for CONV_DONE                   */
#define _CONV_IEN_DONE_MASK                      0x1UL                                  /**< Bit mask for CONV_DONE                      */
#define _CONV_IEN_DONE_DEFAULT                   0x00000000UL                           /**< Mode DEFAULT for CONV_IEN                   */
#define CONV_IEN_DONE_DEFAULT                    (_CONV_IEN_DONE_DEFAULT << 0)          /**< Shifted mode DEFAULT for CONV_IEN           */

/** @} End of group EFR32FG25_CONV_BitFields */
/** @} End of group EFR32FG25_CONV */
/** @} End of group Parts */

#endif /* EFR32FG25_CONV_H */
